docs(design): migrate contracts to plantuml
